Tekla Open API Reference for Tekla Structures 2025
RebarPropertyModifier.GetAffectedBars Method
 Gets the virtual bars affected by this modifier.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ModelObjectEnumerator GetAffectedBars()
Public Function GetAffectedBars As ModelObjectEnumerator
Return Value
Type: ModelObjectEnumerator
A ModelObjectEnumerator containing the virtual rebars of the rebar set that are affected.
See Also
Reference
RebarPropertyModifier Class
Tekla.Structures.Model Namespace